#pragma once
#include "math_parser.h"

bool push(tokens token, stack* st1);//מטרת כניסה: קבלת טוקן ומצביע למחסנית, טענת יציאה: דחיפת הטוקן למחסנית והחזרת אמת או שקר אם הפעולה הצליחה

bool pop(stack* st1, tokens* t1);//מטרת כניסה: קבלת מצביע למחסנית ומצביע לטוקן, טענת יציאה: החזרת הטוקן בראש המחסנית והחזרת אמת או שקר אם הפעולה הצליחה

bool peek(stack* st1, tokens* t1);//מטרת כניסה: קבלת מצביע למחסנית ומצביע לטוקן, טענת יציאה: החזרת הטוקן הנוכחי בלי להוציאו מהמחסנית והחזרת אמת או שקר אם הפעולה הצליחה
